[
  {
    "title": "Dr. Mahzabeen Emu Receives Governor General’s Academic Gold Medal",
    "date": "2025-07-04",
    "excerpt": "Dr. Mahzabeen Emu, a recent PhD graduate from Queen’s University and alumna of the GOAL Lab, has been awarded the prestigious Governor General’s Academic Gold Medal. She has also joined Memorial University of Newfoundland as a Tenure-Track Assistant Professor.",
    "description": "Dr. Mahzabeen Emu, an accomplished PhD graduate and valued member of the GOAL Lab alumni community, was recently awarded the Governor General’s Academic Gold Medal at her PhD convocation at Queen’s University. This accolade marks her second Governor General’s Gold Medal in Canada, having previously received one for her Master’s degree, and her third academic gold medal overall—an extraordinary achievement underscoring her academic excellence and dedication.\n\nAdding to the significance of the moment, her PhD supervisor, Dr. Kai Salomaa, was simultaneously honored with the Excellence in Graduate Supervision Award, making the convocation ceremony an especially memorable milestone for both mentor and student. Dr. Emu also expressed deep gratitude to her supervisors, Dr. Salimur Choudhury and Dr. Kai Salomaa, and acknowledged the continued support from her academic community throughout her journey.\n\nDr. Emu has now embarked on a new chapter of her career as a Tenure-Track Assistant Professor in the Department of Electrical and Computer Engineering at Memorial University of Newfoundland (MUN). She is actively seeking to recruit graduate students (PhD and Master’s level), both domestic and international, to work on cutting-edge research in the areas of Quantum Computing and Optimization.",
    "featured": true,
    "thumbnail": "n001.jpg"
  },
  {
    "title": "Dr. Naveed Ejaz Receives 2025 Research Award from Queen’s University",
    "date": "2025-07-04",
    "excerpt": "Dr. Naveed Ejaz, a postdoctoral researcher in the GOAL Lab, has been honored with the 2025 Research Award from the School of Computing at Queen’s University, Kingston, Canada.",
    "description": "Dr. Naveed Ejaz, an esteemed postdoctoral researcher in the GOAL Lab and AI Researcher specializing in Deep Learning, has been awarded the prestigious 2025 Research Award by the School of Computing at Queen’s University, Kingston, Canada. This recognition highlights his outstanding contributions to the field of Artificial Intelligence and his dedication to advancing impactful research.\n\nDr. Ejaz expressed heartfelt gratitude to his supervisor, Dr. Salimur Choudhury, and his colleagues for their unwavering support and encouragement throughout his research journey. He emphasized that this award is a shared achievement, reflecting the collaborative spirit of the GOAL Lab. The recognition serves as a powerful motivator for Dr. Ejaz to continue pushing the boundaries of innovation in AI and Deep Learning.\n\nAs an experienced educator and industry-academia collaborator, Dr. Ejaz remains committed to fostering cutting-edge research and mentoring the next generation of scholars in the field of Artificial Intelligence.",
    "featured": true,
    "thumbnail": "n002.jpg"
  }
]